[
    {
        "role": "Intern Analyst - Cybersecurity",
        "duration": "June 2024 - August 2024",
        "company": "Wells Fargo",
        "location": "Chandler, AZ",
        "duties": [
            "Conducted a comprehensive analysis of a phishing email incident, identifying malicious URLs through FireEye and Proofpoint alerts. Determined no credentials were harvested by tracing DNS queries and sandbox testing redirects, leading to the blocking of malicious domains and URLs, and implementing targeted user awareness training.",
            "Investigated a web data exfiltration alert triggered by suspicious traffic to an unapproved domain, identifying a high outbound data transfer ratio. Verified the domain's legitimacy through previous case reference and escalated to Tier 2 with recommended tuning actions to prevent future false positives.",
            "Gained hands-on experience in a tiered SOC environment by shadowing CTFC members, observing the investigation and resolution of various cases, including cloud-related incidents, and enhancing knowledge of SOC operations and workflows.",
            "Led a strategic initiative within the Digital Product Management team by conducting 36 interviews across the cyber defense organization to identify operational gaps and pain-points. Analyzed the collected data and presented actionable insights to the Digital Product Management Director, contributing to the development of a 3-year strategic plan to address key challenges."
        ]
    },
    {
        "role": "Software Engineering Intern",
        "duration": "May 2023 - August 2023",
        "company": "CVS Health",
        "location": "Phoenix, AZ",
        "duties": [
            "Created a JSON data source to dynamically populate content for a medical symptom web-page in Angular. Performed rigorous accessibility and unit testing; achieved successful deployment to production environment.",
            "Collaborated with eight fellow interns to develop a company-wide recycling improvement initiative, demonstrating strong coordination skills by scheduling meetings, liaising with project leads, and facilitating discussions to ensure project milestones were met.",
            "Developed an Angular template to handle code migration from ATG BCC codebase to Angular codebase; created template that handled information retrieval, display, and styling for 54 clinic affiliate web pages."
        ]
    },
    {
        "role": "NCOIC - Aircraft Operations and Section Training",
        "duration": "March 2014 - August 2022",
        "company":  "United States Air Force",
        "location": "Various",
        "duties": [
            "Instructed 1.5K Air Force and US Government personnel on cargo preparation/pallet build-up, increment monitor, and vehicle training; developed course training plans and conducted periodic course material reviews.",
            "Authored a 40-hour new employee training and onboarding course and administered course to 45 Airmen, increasing contract completion rate and resulting in zero project delays or security incidents.",
            "Certified airworthiness and safely on-loaded the $10B James Webb Space Telescope as the Lead Joint Inspector and Load Team Chief; 16-hour safety and airworthiness inspection, 8-hour aircraft cargo upload."
        ]
    }
]