[
    {
        "projectName": "Yan85 Assembler - Python Assembler for a Custom Architecture",
        "repoLink": "https://github.com/Kev9180/Yan85-Assembler",
        "skillsUsed": "Python, IDA, Binary Ninja, GDB, Linux, Reverse Engineering, Static/Dynamic Analysis",
        "description": "Yan85 is a custom architecture used in several modules and challenges on pwn.college, an educational platform that teaches cybersecurity concepts via CTF challenges. Yan85 uses custom opcodes, registers, and syscalls that need to be reverse engineered using a static and/or dynamic analysis tools such as GDB, IDA, Binary Ninja, and more. I wanted to make a simple assembler that would make this process easier by automating some of the leg-work. My assembler takes custom written \"yancode\", re-adjusts the order of the bytes (if necessary), and converts that code to bytecode before sending that bytecode into the challene binary. I plan on adding more functionality in the future as I come across more Yan85 challenges, such as making a disassembler and a full-on emulator. This was definitely a fun one!"
    },
    {
        "projectName": "Personal Website (You're looking at it!)",
        "repoLink": "https://github.com/Kev9180/Kev9180.github.io",
        "skillsUsed": "JavaScript, HTML, CSS, JSON, Git, GitHub, GitHub Pages",
        "description": "I created my personal website/portfolio as a way to not only keep a central location for all of my experience, projects, and achievements, but to improve my JavaScript, HTML, and CSS skills. I took advantage of the free hosting service made available via GitHub Pages so I can provide a link to website when necessary. I used JSON files to hold my job experience, education, achievements, and projects to make future updates much easier."
    },
    {
        "projectName": "MXTracker",
        "repoLink": "https://github.com/Kev9180/MXTracker",
        "skillsUsed": "Swift, XCode, iOS, Git, GitHub",
        "description": "MXTracker is an iOS application that helps users track maintenance tasks performed on their vehicles. The app supports unlimited vehicle and maintenance record entries using CoreData, ensuring smooth data management. As someone who maintains their own vehicles, I recognized the need for a centralized, accessible tool to manage maintenance records. This app is designed to help fellow enthusiasts keep track of their vehicle's maintenance history in one place, plan future maintenance easily, and maintain accurate service intervals."
    },
    {
        "projectName": "CVS Clincal Affiliations Code Migration",
        "skillsUsed": "Angular, TypeScript, HTML, CSS, JSON, GCP, Jenkins, CircleCI",
        "description": "During my internship at CVS, I was tasked with updating the landing page for clinic affiliates, as well as the individual clinic affiliate webpages. I coordinated the integration of component files, service files, HTML files, and more within the Angular templates to ensure efficient retrieval and display of accurate clinic information. I successfully pushed the migrated code to production, contributing to the enhanced functionality and usability of the application."
    },
    {
        "projectName": "NASA CubeSat Initiative at ASU",
        "skillsUsed": "C, Linux, Bash",
        "description": "As a member of the ASU Satellite Club, I had the awesome opportunity to help contribute towards writing some of the software for the cubesat that will be launching into space in 2025 as a part of NASA's CubeSat initiative. I researched and located the GPIO header on the hardware, referring to data sheets to identify the necessary pins for the project. I developed a watchdog program in C that monitors the software for anomalies and executes automatic recovery procedures in case of software malfunctions. Additionally, I implemented the GPIO interface to interact with the hardware, ensuring seamless communication between the software and the onboard hardware."
    }
]